// Zad8.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "russian");
    std::cout << "Введите число\n";
    int a;
    cin >> a; 
    cout << a << " * 1 = " << a << "\n";
    cout << a << " * 2 = " << a * 2 << "\n";
    cout << a << " * 3 = " << a * 3 << "\n";
    cout << a << " * 4 = " << a * 4 << "\n";
    cout << a << " * 5 = " << a * 5 << "\n";
    cout << a << " * 6 = " << a * 6 << "\n";
    cout << a << " * 7 = " << a * 7 << "\n";
    cout << a << " * 8 = " << a * 8 << "\n";
    cout << a << " * 9 = " << a * 9 << "\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
